In [1]:
#Frank Yue Ying
#yying2
import pandas as pd
import re

In [2]:
#Problem 1
print("-"*10+"Problem 1"+"-"*10)
a = pd.Series(list(range(5,1,-1)))
b = pd.Series(list(range(10,14)))
c = pd.Series([-1,-1,0,0])
print(a+b)
print(b-a)
print(3*c)
print(a/b)
print(a/c)

0    15
1    15
2    15
3    15
dtype: int64
0     5
1     7
2     9
3    11
dtype: int64
0   -3
1   -3
2    0
3    0
dtype: int64
0    0.500000
1    0.363636
2    0.250000
3    0.153846
dtype: float64
0   -5.0
1   -4.0
2    inf
3    inf
dtype: float64

In [3]:
a.rename({0:2,1:3,2:4,3:5})
a.rename({0:2,1:3,2:4,3:5},inplace = True)
print(a)

2    5
3    4
4    3
5    2
dtype: int64

In [4]:
print("Since the index betweent a and b,c won't match, computation between those series can only be able to matched items")
print(a+b)
print(b-a)
print(3*c)
print(a/b)
print(a/c)

0     NaN
1     NaN
2    17.0
3    17.0
4     NaN
5     NaN
dtype: float64
0    NaN
1    NaN
2    7.0
3    9.0
4    NaN
5    NaN
dtype: float64
0   -3
1   -3
2    0
3    0
dtype: int64
0         NaN
1         NaN
2    0.416667
3    0.307692
4         NaN
5         NaN
dtype: float64
0    NaN
1    NaN
2    inf
3    inf
4    NaN
5    NaN
dtype: float64

In [5]:
# Problem 2
print("-"*10+"Problem 2"+"-"*10)
saleslist = [[2000.43,234.12],[1887.58,184.45],[2729.10,302.14],[2555.55,289.75],[4208.15,441.12]]
salesData = pd.DataFrame(saleslist, columns = ['Sales','Profit'])
salesData.index = ['Monday','Tuesday','Wednesday','Thursday','Friday']
salesData

             Sales  Profit
Monday     2000.43  234.12
Tuesday    1887.58  184.45
Wednesday  2729.10  302.14
Thursday   2555.55  289.75
Friday     4208.15  441.12

In [6]:
print(salesData["Sales"])
print(salesData["Profit"])
print(salesData.loc['Wednesday'])
print(salesData.loc['Thursday']['Profit'])

Monday       2000.43
Tuesday      1887.58
Wednesday    2729.10
Thursday     2555.55
Friday       4208.15
Name: Sales, dtype: float64
Monday       234.12
Tuesday      184.45
Wednesday    302.14
Thursday     289.75
Friday       441.12
Name: Profit, dtype: float64
Sales     2729.10
Profit     302.14
Name: Wednesday, dtype: float64
289.75

In [7]:
salesData['#Customers'] = [12,10,8,11,22]
print(salesData)
salesData.loc["Saturday"] = [1793.00,184.57,9]
print(salesData)

             Sales  Profit  #Customers
Monday     2000.43  234.12          12
Tuesday    1887.58  184.45          10
Wednesday  2729.10  302.14           8
Thursday   2555.55  289.75          11
Friday     4208.15  441.12          22
             Sales  Profit  #Customers
Monday     2000.43  234.12        12.0
Tuesday    1887.58  184.45        10.0
Wednesday  2729.10  302.14         8.0
Thursday   2555.55  289.75        11.0
Friday     4208.15  441.12        22.0
Saturday   1793.00  184.57         9.0

In [8]:
print(salesData.sum())
print("Sales Total: $%.2f"%(salesData["Sales"].sum()))
print("Profit Total: $%.2f"%(salesData["Profit"].sum()))
print("Total # of customers: %2d "%(salesData["#Customers"].sum()))

Sales         15173.81
Profit         1636.15
#Customers       72.00
dtype: float64
Sales Total: $15173.81
Profit Total: $1636.15
Total # of customers: 72

In [9]:
print("Sales Average: $%.2f"%(salesData["Sales"].mean()))
print("Profit Average: $%.2f"%(salesData["Profit"].mean()))
print("Date with highest sales: "+ salesData["Sales"].idxmax())
print("Date with highest profit: "+ salesData["Profit"].idxmax())
print(salesData.loc[salesData["Sales"].idxmax()])
print(salesData.loc[salesData["Profit"].idxmax()])

Sales Average: $2528.97
Profit Average: $272.69
Date with highest sales: Friday
Date with highest profit: Friday
Sales         4208.15
Profit         441.12
#Customers      22.00
Name: Friday, dtype: float64
Sales         4208.15
Profit         441.12
#Customers      22.00
Name: Friday, dtype: float64

In [10]:
#Problem 3
print("-"*10+"Problem 3"+"-"*10)
contacts = pd.read_csv("contacts.csv")
contacts

   Last Name First Name Phone Number
0      Jones        Bob     555-2828
1      Smith       Mary     555-0110
2         Ng      Thang     555-9511
3       Chou       Mary     555-5775
4      Adams      Harry     555-3225
5   Richards       Jane     555-5555
6        Lin     Carrie     555-7727
7     Murthy     Vedula     555-8185
8     Harris       Mary     555-1212
9      Young       John     555-4947
10      Tran      Ellen     555-4940
11      Hong      Alice     555-4049
12    Miller      Marie     555-3832
13     Reese       Trey     555-3314
14     Ernst    Valerie     555-7918

In [4]:
while True:
    last_n = input("please input last name: ").strip().lower()
    if last_n == 'done':
        break
    first_n = input("please input first name: ").strip().lower()
    row = contacts[contacts['Last Name'].str.lower() == last_n]
    if len(row) == 0:
        print("Error, not found")
    else:
        row = row[row['First Name'].str.lower() == first_n]
        if len(row) == 0:
            print("Error, not found")
        else:
            print(row)

please input last name: chou
please input first name: marry
Error, not found
please input last name: chou
please input first name: mary
  Last Name First Name Phone Number
3      Chou       Mary     555-5775
please input last name: done

In [11]:
new_row = {"Last Name":"Harris","First Name":"Larry","Phone Number":"555-2992"}
contacts = contacts.append(new_row,ignore_index = True)
print(contacts)

   Last Name First Name Phone Number
0      Jones        Bob     555-2828
1      Smith       Mary     555-0110
2         Ng      Thang     555-9511
3       Chou       Mary     555-5775
4      Adams      Harry     555-3225
5   Richards       Jane     555-5555
6        Lin     Carrie     555-7727
7     Murthy     Vedula     555-8185
8     Harris       Mary     555-1212
9      Young       John     555-4947
10      Tran      Ellen     555-4940
11      Hong      Alice     555-4049
12    Miller      Marie     555-3832
13     Reese       Trey     555-3314
14     Ernst    Valerie     555-7918
15    Harris      Larry     555-2992

In [ ]:
print("For part b, I would store the search result into a new dataframe after matching with last name, then use the new df to match with first name")

In [12]:
# Problem 4
print("-"*10+"Problem 4"+"-"*10)
mydata = pd.read_csv("mydata.csv")
print(mydata)

----------Problem 4----------
       Name         Breed  Weight   Age
0      Fido          Mutt    15.0  15.0
1      odie  Irish_Setter    50.0   2.0
2    Snoopy        Beagle    18.0   2.0
3     Barfy          Mutt    20.0   8.0
4      Spot     Dalmatian    25.0  12.0
5      hugo       Terrier     NaN  10.0
6    Lassie        Collie    30.0  75.0
7     Mangy           NaN    40.0  10.0
8     Larry        Basset    25.0   4.0
9     Daryl     Retriever    42.0   8.0
10   Darrel     Chihuahua     9.0  48.0
11   Hotdog     Dachshund     NaN   NaN
12      NaN           Lab     NaN   NaN
13    Harpo      Airedale   200.0   9.0
14    Zeppo     Pekingese    32.0   NaN
15  Groucho       Whippet    49.0   7.0
16      Bob        yorkie     NaN   1.0
17     Thor    Great Dane   105.0   6.0
18    Brian         Akita     NaN  12.0
19   Farkas         Boxer    52.0   9.0

In [13]:
t1 = mydata.dropna()
print(t1)

       Name         Breed  Weight   Age
0      Fido          Mutt    15.0  15.0
1      odie  Irish_Setter    50.0   2.0
2    Snoopy        Beagle    18.0   2.0
3     Barfy          Mutt    20.0   8.0
4      Spot     Dalmatian    25.0  12.0
6    Lassie        Collie    30.0  75.0
8     Larry        Basset    25.0   4.0
9     Daryl     Retriever    42.0   8.0
10   Darrel     Chihuahua     9.0  48.0
13    Harpo      Airedale   200.0   9.0
15  Groucho       Whippet    49.0   7.0
17     Thor    Great Dane   105.0   6.0
19   Farkas         Boxer    52.0   9.0

In [14]:
print("Average weight is: %.2f"%(t1["Weight"].mean()))
print("Average age is: %.2f"%(t1["Age"].mean()))

Average weight is: 49.23
Average age is: 15.77

In [15]:
t2 = mydata.copy()
t2["Weight"] = t2["Weight"].fillna(t1["Weight"].mean())
print(t2)

       Name         Breed      Weight   Age
0      Fido          Mutt   15.000000  15.0
1      odie  Irish_Setter   50.000000   2.0
2    Snoopy        Beagle   18.000000   2.0
3     Barfy          Mutt   20.000000   8.0
4      Spot     Dalmatian   25.000000  12.0
5      hugo       Terrier   49.230769  10.0
6    Lassie        Collie   30.000000  75.0
7     Mangy           NaN   40.000000  10.0
8     Larry        Basset   25.000000   4.0
9     Daryl     Retriever   42.000000   8.0
10   Darrel     Chihuahua    9.000000  48.0
11   Hotdog     Dachshund   49.230769   NaN
12      NaN           Lab   49.230769   NaN
13    Harpo      Airedale  200.000000   9.0
14    Zeppo     Pekingese   32.000000   NaN
15  Groucho       Whippet   49.000000   7.0
16      Bob        yorkie   49.230769   1.0
17     Thor    Great Dane  105.000000   6.0
18    Brian         Akita   49.230769  12.0
19   Farkas         Boxer   52.000000   9.0

In [16]:
t3 = mydata.copy()
t3["Age"] = t2["Age"].fillna(t1["Age"].mean())
print(t3)

       Name         Breed  Weight        Age
0      Fido          Mutt    15.0  15.000000
1      odie  Irish_Setter    50.0   2.000000
2    Snoopy        Beagle    18.0   2.000000
3     Barfy          Mutt    20.0   8.000000
4      Spot     Dalmatian    25.0  12.000000
5      hugo       Terrier     NaN  10.000000
6    Lassie        Collie    30.0  75.000000
7     Mangy           NaN    40.0  10.000000
8     Larry        Basset    25.0   4.000000
9     Daryl     Retriever    42.0   8.000000
10   Darrel     Chihuahua     9.0  48.000000
11   Hotdog     Dachshund     NaN  15.769231
12      NaN           Lab     NaN  15.769231
13    Harpo      Airedale   200.0   9.000000
14    Zeppo     Pekingese    32.0  15.769231
15  Groucho       Whippet    49.0   7.000000
16      Bob        yorkie     NaN   1.000000
17     Thor    Great Dane   105.0   6.000000
18    Brian         Akita     NaN  12.000000
19   Farkas         Boxer    52.0   9.000000

In [17]:
t4 = t2.copy()
t4["Age"] = t4["Age"].fillna(t1["Age"].mean())
print(t4)

       Name         Breed      Weight        Age
0      Fido          Mutt   15.000000  15.000000
1      odie  Irish_Setter   50.000000   2.000000
2    Snoopy        Beagle   18.000000   2.000000
3     Barfy          Mutt   20.000000   8.000000
4      Spot     Dalmatian   25.000000  12.000000
5      hugo       Terrier   49.230769  10.000000
6    Lassie        Collie   30.000000  75.000000
7     Mangy           NaN   40.000000  10.000000
8     Larry        Basset   25.000000   4.000000
9     Daryl     Retriever   42.000000   8.000000
10   Darrel     Chihuahua    9.000000  48.000000
11   Hotdog     Dachshund   49.230769  15.769231
12      NaN           Lab   49.230769  15.769231
13    Harpo      Airedale  200.000000   9.000000
14    Zeppo     Pekingese   32.000000  15.769231
15  Groucho       Whippet   49.000000   7.000000
16      Bob        yorkie   49.230769   1.000000
17     Thor    Great Dane  105.000000   6.000000
18    Brian         Akita   49.230769  12.000000
19   Farkas         Boxer   52.000000   9.000000

In [18]:
t5 = mydata.fillna(method = 'ffill')
print(t5)

       Name         Breed  Weight   Age
0      Fido          Mutt    15.0  15.0
1      odie  Irish_Setter    50.0   2.0
2    Snoopy        Beagle    18.0   2.0
3     Barfy          Mutt    20.0   8.0
4      Spot     Dalmatian    25.0  12.0
5      hugo       Terrier    25.0  10.0
6    Lassie        Collie    30.0  75.0
7     Mangy        Collie    40.0  10.0
8     Larry        Basset    25.0   4.0
9     Daryl     Retriever    42.0   8.0
10   Darrel     Chihuahua     9.0  48.0
11   Hotdog     Dachshund     9.0  48.0
12   Hotdog           Lab     9.0  48.0
13    Harpo      Airedale   200.0   9.0
14    Zeppo     Pekingese    32.0   9.0
15  Groucho       Whippet    49.0   7.0
16      Bob        yorkie    49.0   1.0
17     Thor    Great Dane   105.0   6.0
18    Brian         Akita   105.0  12.0
19   Farkas         Boxer    52.0   9.0

In [20]:
t6 = t4.copy()
t6["Age"][t6["Age"]>18] = t1["Age"].mean()
print(t6)

       Name         Breed      Weight        Age
0      Fido          Mutt   15.000000  15.000000
1      odie  Irish_Setter   50.000000   2.000000
2    Snoopy        Beagle   18.000000   2.000000
3     Barfy          Mutt   20.000000   8.000000
4      Spot     Dalmatian   25.000000  12.000000
5      hugo       Terrier   49.230769  10.000000
6    Lassie        Collie   30.000000  15.769231
7     Mangy           NaN   40.000000  10.000000
8     Larry        Basset   25.000000   4.000000
9     Daryl     Retriever   42.000000   8.000000
10   Darrel     Chihuahua    9.000000  15.769231
11   Hotdog     Dachshund   49.230769  15.769231
12      NaN           Lab   49.230769  15.769231
13    Harpo      Airedale  200.000000   9.000000
14    Zeppo     Pekingese   32.000000  15.769231
15  Groucho       Whippet   49.000000   7.000000
16      Bob        yorkie   49.230769   1.000000
17     Thor    Great Dane  105.000000   6.000000
18    Brian         Akita   49.230769  12.000000
19   Farkas         Boxer   52.000000   9.000000

C:\Users\yingy\AppData\Local\Programs\Python\Python37\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [21]:
t7 = t6.copy()
t7["Weight"][t6["Weight"]>150] = t1["Weight"].mean()
print(t7)

       Name         Breed      Weight        Age
0      Fido          Mutt   15.000000  15.000000
1      odie  Irish_Setter   50.000000   2.000000
2    Snoopy        Beagle   18.000000   2.000000
3     Barfy          Mutt   20.000000   8.000000
4      Spot     Dalmatian   25.000000  12.000000
5      hugo       Terrier   49.230769  10.000000
6    Lassie        Collie   30.000000  15.769231
7     Mangy           NaN   40.000000  10.000000
8     Larry        Basset   25.000000   4.000000
9     Daryl     Retriever   42.000000   8.000000
10   Darrel     Chihuahua    9.000000  15.769231
11   Hotdog     Dachshund   49.230769  15.769231
12      NaN           Lab   49.230769  15.769231
13    Harpo      Airedale   49.230769   9.000000
14    Zeppo     Pekingese   32.000000  15.769231
15  Groucho       Whippet   49.000000   7.000000
16      Bob        yorkie   49.230769   1.000000
17     Thor    Great Dane  105.000000   6.000000
18    Brian         Akita   49.230769  12.000000
19   Farkas         Boxer   52.000000   9.000000

C:\Users\yingy\AppData\Local\Programs\Python\Python37\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [22]:
t8 = t7.copy()
t8["Age"] = t8["Age"].astype(int)
print(t8)

       Name         Breed      Weight  Age
0      Fido          Mutt   15.000000   15
1      odie  Irish_Setter   50.000000    2
2    Snoopy        Beagle   18.000000    2
3     Barfy          Mutt   20.000000    8
4      Spot     Dalmatian   25.000000   12
5      hugo       Terrier   49.230769   10
6    Lassie        Collie   30.000000   15
7     Mangy           NaN   40.000000   10
8     Larry        Basset   25.000000    4
9     Daryl     Retriever   42.000000    8
10   Darrel     Chihuahua    9.000000   15
11   Hotdog     Dachshund   49.230769   15
12      NaN           Lab   49.230769   15
13    Harpo      Airedale   49.230769    9
14    Zeppo     Pekingese   32.000000   15
15  Groucho       Whippet   49.000000    7
16      Bob        yorkie   49.230769    1
17     Thor    Great Dane  105.000000    6
18    Brian         Akita   49.230769   12
19   Farkas         Boxer   52.000000    9

In [23]:
t9 = t8.copy()
t9["Name"] = t9["Name"].fillna("Barfy")
t9["Name"] = t9["Name"].apply(lambda x: x.upper())
t9=t9.rename(columns = {'Name':'Search Name'})
print(t9)

   Search Name         Breed      Weight  Age
0         FIDO          Mutt   15.000000   15
1         ODIE  Irish_Setter   50.000000    2
2       SNOOPY        Beagle   18.000000    2
3        BARFY          Mutt   20.000000    8
4         SPOT     Dalmatian   25.000000   12
5         HUGO       Terrier   49.230769   10
6       LASSIE        Collie   30.000000   15
7        MANGY           NaN   40.000000   10
8        LARRY        Basset   25.000000    4
9        DARYL     Retriever   42.000000    8
10      DARREL     Chihuahua    9.000000   15
11      HOTDOG     Dachshund   49.230769   15
12       BARFY           Lab   49.230769   15
13       HARPO      Airedale   49.230769    9
14       ZEPPO     Pekingese   32.000000   15
15     GROUCHO       Whippet   49.000000    7
16         BOB        yorkie   49.230769    1
17        THOR    Great Dane  105.000000    6
18       BRIAN         Akita   49.230769   12
19      FARKAS         Boxer   52.000000    9

In [24]:
t10 = pd.concat([t8,t9["Search Name"]],axis = 1)
print(t10)

       Name         Breed      Weight  Age Search Name
0      Fido          Mutt   15.000000   15        FIDO
1      odie  Irish_Setter   50.000000    2        ODIE
2    Snoopy        Beagle   18.000000    2      SNOOPY
3     Barfy          Mutt   20.000000    8       BARFY
4      Spot     Dalmatian   25.000000   12        SPOT
5      hugo       Terrier   49.230769   10        HUGO
6    Lassie        Collie   30.000000   15      LASSIE
7     Mangy           NaN   40.000000   10       MANGY
8     Larry        Basset   25.000000    4       LARRY
9     Daryl     Retriever   42.000000    8       DARYL
10   Darrel     Chihuahua    9.000000   15      DARREL
11   Hotdog     Dachshund   49.230769   15      HOTDOG
12      NaN           Lab   49.230769   15       BARFY
13    Harpo      Airedale   49.230769    9       HARPO
14    Zeppo     Pekingese   32.000000   15       ZEPPO
15  Groucho       Whippet   49.000000    7     GROUCHO
16      Bob        yorkie   49.230769    1         BOB
17     Thor    Great Dane  105.000000    6        THOR
18    Brian         Akita   49.230769   12       BRIAN
19   Farkas         Boxer   52.000000    9      FARKAS